app/Controllers/Home.php

    public function index(){
        if(session("magicLogin") OR (auth()->user()->requiresPasswordReset())) {
            return redirect()->to("/user-management/password-reset")->with("message", "Please set new password");
        }
        $search = isset($_POST['search']) ? $_POST['search'] : '';
        $Output_query = $this->db->table('8yxztimesheet');
        if($search != ''){
            $Output_query->groupStart();
                $Output_query->like('employees.first_name',$search);
                $Output_query->orLike('employees.last_name',$search);
            $Output_query->groupEnd();
        }
        $Output_query->select('timesheet.*,employees.first_name,employees.last_name');
        $Output_query->join('employees', 'employees.id = 8yxztimesheet.employee_id');
        $Output = $Output_query->orderBy('employees.id', 'DESC')->get()->getResultArray();
---
SELECT `8yxztimesheet`.*, `8yxzemployees`.`first_name`, `8yxzemployees`.`last_name`
FROM `8yxztimesheet`
JOIN `8yxzemployees` ON `8yxzemployees`.`id` = `8yxztimesheet`.`employee_id`
ORDER BY `8yxzemployees`.`id` DESC